Repository: Nodibell/MeetMind
Catalog: MeetMind/Localizable.xcstrings
Source language: uk
Languages: en

source: %lld сегментів
en: %lld segments

source: • Хто відповідальний за реліз продукту?
en: • Who is responsible for the product release?

source: • Які ключові рішення були прийняті за весь час?
en: • What key decisions were made over time?

# AI
source: ШІ
en: AI

source: AI Аналіз
en: AI Analysis

source: AI Резюме
en: AI Summary

source: AI-помічник для нарад
en: AI Meeting Assistant

source: Apple Intelligence (Локально)
en: Apple Intelligence (Local)

source: Apple Intelligence (офлайн)
en: Apple Intelligence (offline)

source: Apple Intelligence та DeepMLX не мають API ембедингів. Для RAG потрібен окремий Ollama або LM Studio сервер.
en: Apple Intelligence and DeepMLX do not have API embeddings. A separate Ollama or LM Studio server is required for RAG.

source: DeepMLX завантажує MLX-моделі безпосередньо в MeetMind через Apple Silicon Metal. Модель автоматично вивантажується з пам'яті (VRAM) одразу після завершення аналізу.
en: DeepMLX loads MLX models directly into MeetMind via Apple Silicon Metal. The model is automatically unloaded from memory (VRAM) immediately after the analysis is complete.

# English
source: Англійська
en: English

source: large-v3-turbo для live, large-v3 для якісної транскрипції
en: large-v3-turbo for live, large-v3 for quality transcription

source: Live (швидка)
en: Live (fast)

source: Ollama — резюме та завдання
en: Ollama — summary and tasks

source: Post-processing (якісна)
en: Post-processing (high quality)

source: Q&A Чат
en: Q&A Chat

source: WhisperKit — українська мова
en: WhisperKit — multiple languages

source: Авто
en: Auto

source: Авто-визначення
en: Auto-detection

source: Автоматична обробка
en: Auto-processing

source: Автоматичний експорт нотаток
en: Automatic note export

source: Автоматичний експорт після завершення
en: Auto-export after completion

source: Автоматично витягнуті з усіх нарад
en: Automatically extracted from all meetings

source: Автоматично обробляти нові файли
en: Auto-process new files

source: Адреса сервера ембедингів не вказана. Перевірте Endpoint у налаштуваннях провайдера.
en: The address of the embedding server is not specified. Check the Endpoint in the provider's settings.

source: Аналіз
en: Analysis

source: Аналіз по всіх ваших нарад %lld
en: Analysis of all your meetings %lld

source: Аналіз усіх ваших нарад (%lld)
en: Analysis of all your meetings (%lld)

source: Аналіз...
en: Analysis...

source: Аналізую...
en: Analyzing...

source: Англійська
en: English

source: Аудіо
en: Audio

source: Аудіо пристрій
en: Audio Device

source: Базу даних було відновлено (скинуто)
en: Database has been restored (reset)

source: Вбудована модель (MiniLM)
en: Built-in Model (MiniLM)

source: Векторний індекс
en: Vector Index

source: Вибрати всі
en: Choose All

source: Вивантаження моделі
en: Model Unload

source: Вивантажити одразу
en: Unload immediately

source: Видалити
en: Delete

source: Видалити групу
en: Delete group

source: Видалити нараду?
en: Delete meeting?

source: Видалити розмову
en: Delete conversation

source: Вийти з додатка
en: Exit the app

source: Використовує нативну модель Apple Intelligence на вашому Mac. Працює повністю локально, конфіденційно та без підключення до інтернету.
en: Uses the native Apple Intelligence model on your Mac. Works completely locally, confidentially and without an Internet connection.

source: Використовує оптимізовану CoreML-модель `all-MiniLM-L6-v2` (Float16, ~42 MB). Працює миттєво, повністю автономно та без навантаження на мережу (Рекомендовано).
en: Uses optimized CoreML model `all-MiniLM-L6-v2` (Float16, ~42 MB). Works instantly, fully offline and without network load (Recommended).

source: Використовується для векторизації нарад. Рекомендовано: nomic-embed-text або bge-small-en.
en: Used for vectorization of meetings. Recommended: nomic-embed-text or bge-small-en.

source: Вилучення аудіодоріжки з файлу...
en: Extracting audio track from file...

source: Вилучення...
en: Extracting...

source: Виникла помилка бази даних. (%@)
en: Database error. (%@)

source: Витягуємо аудіо...
en: Extracting audio...

source: Вища частота оновлення забезпечує плавнішу анімацію, але може споживати більше енергії
en: Higher refresh rate provides smoother animation but may consume more power

source: Візуалізація
en: Visualization

source: Все готово!
en: All set!

source: Генерація резюме через AI...
en: Generating AI summary...

source: Генеруємо резюме...
en: Generating summary...

source: Глобальний запит
en: Global Query

source: Готовий до аналізу
en: Ready for analysis

source: Готово
en: Done

source: Готово!
en: Done!

source: Групи нарад (RAG)
en: Meeting Groups (RAG)

source: Далі
en: Next

source: Джерела:
en: Sources:

source: Джерело
en: Source

source: Для LM Studio вкажіть адресу локального сервера (напр. http://localhost:1234)
en: For LM Studio, specify the local server address (e.g. http://localhost:1234)

source: Для LM Studio вкажіть адресу локального сервера (напр. http://localhost:1234/v1)
en: For LM Studio, specify the local server address (e.g., http://localhost:1234/v1)

source: Для Ollama вкажіть адресу сервера (напр. http://localhost:11434)
en: For Ollama, specify the server address (e.g., http://localhost:11434)

source: Для запису системного звуку необхідно надати доступ до запису екрану в Системних параметрах.
en: To record the system sound, you must provide access to the screen recording in System Settings.

source: Для режимів Система та Мікс можна вибрати весь екран або конкретне вікно
en: For System and Mix modes, you can select the full screen or a specific window

source: Додайте списки завдань у резюме нарад
en: Add task lists to meeting summaries

source: Додати або видалити наради
en: Add or remove meetings

source: Додати наради
en: Add meetings

source: Додати наради до групи
en: Add meetings to group

source: Додатковий Промпт для Резюме
en: Custom Summary Prompt

source: Експортовано в Obsidian
en: Exported to Obsidian

source: Експортувати нараду як Markdown-нотатку в Obsidian Vault
en: Export meeting as Markdown note to Obsidian Vault

source: Живий транскрипт
en: Live Transcript

source: За датою
en: By date

source: За назвою
en: By title

source: За тривалістю
en: By duration

source: Завантаження AI моделей
en: Downloading AI Models

source: Завантаження групи...
en: Loading group...

source: Завантаження завершено
en: Download complete

source: Завантаження завершено. Ініціалізація та оптимізація моделі Whisper (це може зайняти 1-2 хвилини)...
en: Download complete. Initializing and optimizing the Whisper model (it may take 1-2 minutes)...

source: Завантаження моделі AI
en: AI Model Download

source: Завантаження моделі з Hugging Face...
en: Downloading model from Hugging Face...

source: Завантаження моделі: %lld\%
en: Downloading model: %lld%%

source: Завантаження наради...
en: Loading meeting…

source: Завантаження та ініціалізація успішно завершені
en: Download and initialization completed successfully

source: Завантаження транскрипту...
en: Loading transcript...

source: Завантажити LM Studio
en: Download LM Studio

source: Завантажити Ollama
en: Download Ollama

source: Завдання
en: Tasks

source: Завдання (Action Items)
en: Action Items

source: Завдань не знайдено
en: No tasks found

source: Завершено
en: Completed

source: Загальне
en: General

source: Задайте питання по транскрипту...
en: Ask about the transcript...

source: Задайте питання щодо нарад
en: Ask about the meeting

source: Задайте питання щодо наради
en: Ask about the meeting

source: Задайте питання щодо наради...
en: Ask a question about the meeting...

source: Запис
en: Recording

source: Запис аудіо
en: Audio Recording

source: Запис екрану
en: Screen Recording

source: Запис...
en: Recording...

source: Записи
en: Recordings

source: Запитайте MeetMind...
en: Ask MeetMind...

source: Запитайте про деталі цієї групи нарад...
en: Ask about details of this meeting group...

source: Запитайте свої наради
en: Ask your meetings

source: Запитайте що завгодно
en: Ask anything

source: Зберегти
en: Save

source: Збережені чати
en: Saved chats

source: Зверніть увагу: Apple Intelligence наразі не підтримує обробку української мови. При обробці українських нарад система автоматично спробує використати інші налаштовані локальні інструменти (Ollama або MLX) як резервні.
en: Please note: Apple Intelligence does not currently support Ukrainian language processing. When processing Ukrainian meetings, the system will automatically try to use other configured local tools (Ollama or MLX) as backup tools.

source: Згенерувати резюме
en: Generate summary

source: Зняти виділення
en: Remove selection

source: Зовнішній вигляд та Мова
en: Appearance and Language

source: Зовнішній сервер (Ollama / LM Studio)
en: External Server (Ollama / LM Studio)

source: Зрозуміло
en: Understood

source: Зупинити
en: Stop

source: Зупинити відповідь
en: Stop response

source: Зупинка запису...
en: Stopping recording...

source: Зупинка...
en: Stopping...

source: Ім’я
en: Name

source: Імпортувати аудіо/відео
en: Import audio/video

source: Ініціалізація моделі AI...
en: Initializing AI model...

source: Ініціалізація...
en: Initializing...

source: Керування пам'яттю (VRAM / RAM)
en: Memory Management (VRAM / RAM)

source: Керує тим, коли завантажена модель вивантажується з пам'яті комп'ютера після останнього запиту. Це дозволяє економити ресурси відеокарти та оперативної пам'яті вашого Mac.
en: Controls when the loaded model is unloaded from the computer's memory after the last request. This saves GPU VRAM and system RAM on your Mac.

source: Колір
en: Color

source: Копіювати
en: Copy

source: Ласкаво просимо до MeetMind
en: Welcome to MeetMind

source: Локальна MLX Модель
en: Local MLX Model

source: Локальна обробка на пристрої
en: Local on-device processing

source: Локальний LLM (Ollama/MLX)
en: Local LLM (Ollama/MLX)

source: Ми завантажуємо Whisper (транскрипція) та Llama 3 (аналіз). Це займе кілька хвилин, оскільки все працює локально.
en: We are downloading Whisper (transcription) and Llama 3 (analysis). This will take a few minutes as everything runs locally.

source: Ми завантажуємо модель Whisper для швидкої та приватної локальної транскрипції голосу на вашому Mac. Це займе кілька хвилин.
en: We are downloading the Whisper model for fast and private local voice transcription on your Mac. This will take a few minutes.

source: Мікрофон
en: Microphone

source: Мікрофон або системне аудіо
en: Microphone or system audio

source: Мікс
en: Mix

source: Місцевий ШІ проаналізує всі транскрипти цієї групи за допомогою RAG та надасть консолідовану відповідь.
en: Local AI will analyze all transcripts in this group using RAG and provide a consolidated answer.

source: Мова
en: Language

source: Мова використовується для транскрипції та аналізу
en: Language used for transcription and analysis

source: Мова інтерфейсу
en: App Language

source: Мова резюме (за замовчуванням)
en: Summary Language (default)

source: Мова транскрипту
en: Transcript Language

source: Модель
en: Model

source: Модель Whisper
en: Whisper Model

source: Модель Ембедингів
en: Embeding Model

source: Модель Ембедингів (RAG)
en: Embeding Model (RAG)

source: На нашу думку, це %@?
en: We think this is %@?

source: Надати доступ
en: Grant Access

source: Надіслати питання
en: Send question

source: Назад
en: Back

source: Назва
en: Name

source: Назва наради
en: Meeting Title

source: Налаштування
en: Settings

source: Налаштування спікера
en: Speaker Settings

source: Налаштуймо все для професійної роботи
en: Let's set everything up for professional work

source: Наприклад: Проєкт Альфа
en: e.g., Project Alpha

source: Нарад не знайдено
en: Meeting not found

source: Нарада «%@» буде видалена разом з аудіозаписом і транскриптом. Цю дію не можна скасувати.
en: The meeting "%@" will be deleted along with the audio recording and transcript. This action cannot be undone.

source: Наради
en: Meetings

source: Наради в цій групі (%lld)
en: Meetings in this group (%lld)

source: Нараду не знайдено
en: Meeting not found

source: Натисніть + щоб почати запис
en: Press + to start recording

source: Натисніть, щоб перейменувати спікера
en: Click to rename the speaker

source: Натисніть, щоб підтвердити пропозицію
en: Click to confirm the suggestion

source: Не вдалося експортувати аудіо: %@
en: Failed to export audio: %@

source: Не вдалося завантажити аудіо: %@
en: Failed to load audio:

source: Не вдалося завантажити модель Whisper: %@
en: Failed to load Whisper:

source: Не вдалося завантажити модель: %@
en: Failed to load model:

source: Не вдалося створити сесію експорту аудіо
en: Failed to create audio export session

source: Не вивантажувати
en: Do not unload

source: Не обрано
en: Not selected

source: Не перевірено
en: Not verified

source: Невідомий
en: Unknown

source: Немає груп
en: No groups yet

source: Немає збережених розмов
en: No saved conversations

source: Немає контенту
en: No content present

source: Немає нарад
en: No meetings

source: Необхідно для запису вашого голосу
en: Required for recording your voice

source: Необхідно для захоплення системного аудіо (Zoom, Teams)
en: Required for capturing system audio (Zoom, Teams)

source: Нова група нарад (RAG)
en: New Meeting Group (RAG)

source: Нова нарада
en: New Meeting

source: Новий запис
en: New Recording

source: Нотатки зберігаються в {Vault}/Meetings/
en: Notes are saved in {Vault}/Meetings/

source: Об’єднайте кілька нарад, щоб задавати питання по всій базі знань одночасно.
en: Combine multiple meetings to query the entire knowledge base at once.

source: Оберіть наради, які ви хочете включити до RAG аналізу
en: Select the meetings you want to include in the RAG analysis

source: Обрати папку
en: Select folder

source: Обрати папку моделі MLX
en: Choose MLX Model Folder

source: Оновити
en: Refresh

source: Оновити список вікон
en: Refresh window list

source: Оновити список джерел
en: Refresh source list

source: Оновити список пристроїв
en: Refresh device list

source: Оновлення транскрипту...
en: Updating transcript...

source: Опис (необов’язково)
en: Description (optional)

source: Опишіть тематику цієї групи нарад...
en: Describe the topic of this meeting group...

source: Очистити історію чату
en: Clear chat history

source: Очікування на мовлення...
en: Waiting for speech...

source: Очікування транскрипту...
en: Waiting for transcript...

source: Очікування...
en: Waiting...

source: Пауза
en: Pause

source: Перевірити з'єднання
en: Check Connection

source: Перевірити статус
en: Check Status

source: Перевірка...
en: Checking...

source: Переіндексувати групу
en: Reindex group

source: Переклад
en: Translation

source: Переклад активний (таймстампи збережено)
en: Translation active (timestamps preserved)

source: Перекладаємо...
en: Translating...

source: Перекласти транскрипт на іншу мову за допомогою AI або Apple Intelligence
en: Translate transcript to another language using AI or Apple Intelligence

source: Перетягніть для транскрипції
en: Drop to transcribe

source: Підготовка джерела аудіо...
en: Preparing audio source...

source: Підготовка до індексації...
en: Preparing for indexing...

source: Підготовка...
en: Preparing...

source: Підключення
en: Connection

source: Підключено
en: Connected

source: Підтримувані формати: WAV, MP3, M4A, FLAC, AAC
en: Supported formats: WAV, MP3, M4A, FLAC, AAC

source: Показати виконані
en: Show completed

source: Показати оригінал
en: Show original

source: Помилка
en: Error

source: Помилка Apple Translation: %@
en: Apple Translation error: %@

source: Помилка аналізу: %@
en: Analysis error: %@

source: Помилка обробки
en: Processing error

source: Помилка транскрипції файлу: %@
en: File transcription error: %@

source: Помилка транскрипції: %@
en: Transcription error: %@

source: Попередній файл бази даних містив помилки міграції. Створено резервну копію в папці Backups: %@
en: The previous database file contained migration errors. A backup was created in the Backups folder: %@

source: Попередній файл містив помилки міграції. Резервну копію збережено в папці Backups. (%@)
en: The previous file contained migration errors. A backup was created in the Backups folder: %@

source: Почати завантаження
en: Start Download

source: Почати запис
en: Start Recording

source: Почати новий чат
en: Start new chat

source: Почати роботу
en: Get Started

source: Пошук завдань...
en: Searching for tasks...

source: Пошук нарад за назвою...
en: Search for meetings by name...

source: Пошук нарад...
en: Search meetings...

source: Пошук...
en: Search...

source: Призупинено
en: Paused

source: Пристрій введення
en: Input Device

source: Приховати виконані
en: Hide completed

source: Провайдер
en: Provider

source: Провайдер ембедингів
en: Embedding provider

source: Продовжити
en: Resume

source: Резюме
en: Summary

source: Резюме буде згенеровано після запису
en: Summary will be generated after recording

source: Рекомендовані: gemma3:12b, qwen2.5:14b (підтримують українську)
en: Recommended: gemma3:12b, qwen2.5:14b (support Ukrainian)

source: Рішення ембедингів
en: Embedding Solution

source: Світла
en: Light

source: сегментів
en: segments

source: Сервіс
en: Service

source: Сервіс транскрипції не ініціалізовано. Зачекайте завантаження моделі.
en: Transcription service is not initialized. Please wait for the model to download.

source: Система
en: System

source: Системна
en: System

source: Системне аудіо
en: System Audio

source: Скасувати
en: Cancel

source: Скинути
en: Reset

source: Скопійовано
en: Copied

source: Скопіювати повний транскрипт у буфер обміну
en: Copy full transcript to clipboard

source: Сортування
en: Sort

source: Спікер %@
en: Speaker %@

source: Спробувати знову
en: Try Again

source: Спробуйте запитати:
en: Try asking:

source: СПРОБУЙТЕ ЗАПИТАТИ:
en: TRY ASKING:

source: Створи зведення всіх завдань за тиждень
en: Create a summary of all tasks for the week

source: Створити
en: Create

source: Створити нову групу
en: Create new group

source: Сховище
en: Storage

source: тег
en: tag

source: Тема оформлення
en: Interface Theme

source: Темна
en: Dark

source: Тепер ваші наради будуть автоматично транскрибуватися та аналізуватися професійним AI асистентом.
en: Now your meetings will be automatically transcribed and analyzed by a professional AI assistant.

source: Тиша
en: Silence

source: Транскрибування (high-quality): %lld\%
en: Transcription (high-quality): %lld%%

source: Транскрибувати файл
en: Transcribe file

source: Транскрибуємо аудіо...
en: Transcribing audio...

source: Транскрипт
en: Transcript

source: Транскрипт буде тут після запису
en: Transcript will appear here after recording

source: Транскрипт відсутній
en: Transcript missing

source: Транскрипти
en: Transcripts

source: Транскрипція
en: Transcription

source: Транскрипція (за замовчуванням)
en: Transcription (default)

source: Транскрипція аудіо (high-quality)...
en: Transcribing audio (high-quality)...

source: Транскрипція...
en: Transcription...

source: Тут можна додати власні інструкції (наприклад: 'Завжди форматуй як маркований список').
en: You can add your own instructions here (e.g., 'Always format as a bulleted list').

source: Тут нічого немає
en: Nothing here yet

source: У вибраному файлі не знайдено аудіо доріжки
en: No audio track found in the selected file

source: У цій групі ще немає нарад.
en: There are no meetings in this group yet.

source: Українська
en: Ukrainian

source: Файли
en: Files

source: Хто відповідальний за проєкт X?
en: Who is responsible for project X?

source: Частота оновлення хвилі
en: Waveform Refresh Rate

source: Через 1 хвилину
en: After 1 minute

source: Через 5 хвилин
en: After 5 minutes

source: Через 10 хвилин
en: After 10 minutes

source: ШІ аналізує та формулює відповідь...
en: AI analyzes and formulates the answer...

source: Шлях до моделі MLX не обрано
en: MLX model path is not selected

source: Шукаю інформацію в нарадах...
en: Searching meetings...

source: Я можу проаналізувати всі ваші наради і знайти відповіді на будь-яке запитання.
en: I can analyze all your meetings and find answers to any question.

source: Я можу проаналізувати всі ваші наради і знайти відповіді на запитання на кшталт: • «Які рішення по бюджету ми приймали в квітні?» • «Хто відповідальний за проект X?» • «Зроби зведення всіх завдань за тиждень»
en: I can analyze all your meetings and find answers to questions like: • "What budget decisions did we make in April?" • "Who is responsible for project X?" • "Give me a summary of all tasks for the week"

source: Які рішення щодо бюджету було прийнято у квітні?
en: What budget decisions did we make in April?
